artillery-stress-test.yml
# Artillery Stress Test - Push the system to its limits
# Run with: npx artillery run artillery-stress-test.yml
# WARNING: This will put heavy load on your system!

config:
  target: "http://localhost:5000"
  phases:
    # Gradual ramp up
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up to 100 users/sec"

    # High sustained load
    - duration: 180
      arrivalRate: 100
      name: "Sustained 100 users/sec"

    # Extreme peak
    - duration: 60
      arrivalRate: 100
      rampTo: 300
      name: "Push to 300 users/sec"

    # Breaking point test
    - duration: 60
      arrivalRate: 500
      name: "Stress test - 500 users/sec"

  plugins:
    metrics-by-endpoint: {}

  defaults:
    headers:
      Content-Type: "application/json"

  # More lenient thresholds for stress test
  ensure:
    maxErrorRate: 5  # Allow up to 5% errors under extreme load
    p95: 5000        # 95th percentile < 5 seconds
    p99: 10000       # 99th percentile < 10 seconds

scenarios:
  - name: "Mixed Load Scenario"
    flow:
      # Random delay to simulate real user behavior
      - think: 1

      # Health check
      - get:
          url: "/api/health"

      # Random API calls
      - loop:
        - get:
            url: "/api/jobs/search?query={{ $randomString() }}"
        - get:
            url: "/api/scholarships"
        - get:
            url: "/api/internships"
        count: 3